convesys/CS-1211_Test/05_Project/SW_TEST_sysconfig_337zwt/c2000.syscfg
led3.$name                  = "LED3";
led3.gpio.writeInitialValue = true;
led3.gpio.gpioPin.$assign   = "GPIO16";

led4.$name                  = "LED4";
led4.gpio.writeInitialValue = true;
led4.gpio.gpioPin.$assign   = "GPIO19";

const divider3 = system.clockTree["EPWMCLKDIV"];
scripting.suppress("ePWM TZFRC and TZCLR events will sometimes be missed when EPWMCLKDIV is divide by 2\\. Always program EPWMCLKDIV to divide by 1 if using TZFRC or TZCLR register\\. Please refer to the F2837xD Silicon Errata for more details\\.", divider3, "EPWMCLK");

const multiplier4         = system.clockTree["PLL_IMULT"];
multiplier4.multiplyValue = 20;

const pinFunction3     = system.clockTree["XTAL"];
pinFunction3.XTAL_Freq = 20;

cputimer1.$name                    = "CPUTIMER0_inst";
cputimer1.registerInterrupts       = true;
cputimer1.startTimer               = true;
cputimer1.enableInterrupt          = true;
cputimer1.timerPrescaler           = 200;
cputimer1.timerPeriod              = 50;
cputimer1.timerInt.enableInterrupt = true;

cputimer2.$name          = "CPUTIMER1_inst";
cputimer2.cputimerBase   = "CPUTIMER1_BASE";
cputimer2.startTimer     = true;
cputimer2.emulationMode  = "CPUTIMER_EMULATIONMODE_RUNFREE";
cputimer2.timerPeriod    = 65535;
cputimer2.timerPrescaler = 100;

const default_warning = scripting.addModule("/driverlib/default_warning.js", {}, false);
scripting.suppress("Add the \'Device Support\' module in order to use Clock Tree tool and generate device support files\\. This suggestion can be ignored if not using the Clock Tree tool\\.", default_warning);

dma1.$name                  = "DMA0_inst";
dma1.useInterrupts          = true;
dma1.registerInterrupts     = true;
dma1.enableInterrupts       = true;
dma1.enableOverrunInterrupt = true;
dma1.interruptMode          = "DMA_INT_AT_END";
dma1.continuousModeConfig   = "DMA_CFG_CONTINUOUS_ENABLE";
dma1.enableTriggers         = true;
dma1.destAddressInputMode   = "VARIABLE";
dma1.emulationMode          = "DMA_EMULATION_FREE_RUN";
dma1.destAddressVariable    = "ADCA_ResultBufferPtr";
dma1.srcAddressInputMode    = "VARIABLE";
dma1.srcAddressVariable     = "ADCA_ResultRegisterPtr";
dma1.startChannel           = true;
dma1.triggerSource          = "DMA_TRIGGER_ADCA2";
dma1.burstSize              = 16;
dma1.srcBurstStep           = 1;
dma1.srcTransferStep        = -15;
dma1.destBurstStep          = 1;
dma1.destWrapSize           = 65536;
dma1.srcWrapSize            = 65536;
dma1.destTransferStep       = 1;
dma1.transferSize           = 65;
dma1.dmaInt.enableInterrupt = true;

gpio5.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio5.$name           = "inst_GPIO2";
gpio5.gpioPin.$assign = "GPIO2";

gpio6.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio6.$name           = "inst_GPIO3";
gpio6.gpioPin.$assign = "GPIO3";

gpio7.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio7.$name           = "inst_GPIO4";
gpio7.gpioPin.$assign = "GPIO4";

gpio8.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio8.$name           = "inst_GPIO5";
gpio8.gpioPin.$assign = "GPIO5";

gpio9.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio9.$name           = "inst_GPIO6";
gpio9.gpioPin.$assign = "GPIO6";

gpio10.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio10.$name           = "inst_GPIO7";
gpio10.gpioPin.$assign = "GPIO7";

gpio11.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio11.$name           = "inst_GPIO8";
gpio11.gpioPin.$assign = "GPIO8";

gpio12.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio12.$name           = "inst_GPIO9";
gpio12.gpioPin.$assign = "GPIO9";

gpio13.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio13.$name           = "inst_GPIO11";
gpio13.gpioPin.$assign = "GPIO11";

gpio14.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio14.$name           = "inst_GPIO12";
gpio14.gpioPin.$assign = "GPIO12";

gpio15.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio15.$name           = "inst_GPIO13";
gpio15.gpioPin.$assign = "GPIO13";

gpio16.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio16.$name           = "inst_GPIO14";
gpio16.gpioPin.$assign = "GPIO14";

gpio17.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio17.$name           = "inst_GPIO15";
gpio17.gpioPin.$assign = "GPIO15";

gpio18.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio18.$name           = "inst_GPIO10";
gpio18.gpioPin.$assign = "GPIO10";

gpio19.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio19.$name           = "inst_GPIO20";
gpio19.gpioPin.$assign = "GPIO20";

gpio20.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio20.$name           = "inst_GPIO21";
gpio20.gpioPin.$assign = "GPIO21";

gpio21.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio21.$name           = "inst_GPIO22";
gpio21.gpioPin.$assign = "GPIO22";

gpio22.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio22.$name           = "inst_GPIO23";
gpio22.gpioPin.$assign = "GPIO23";

gpio23.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio23.$name           = "inst_GPIO24";
gpio23.gpioPin.$assign = "GPIO24";

gpio24.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio24.$name           = "inst_GPIO25";
gpio24.gpioPin.$assign = "GPIO25";

gpio25.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio25.$name           = "inst_GPIO26";
gpio25.gpioPin.$assign = "GPIO26";

gpio26.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio26.$name           = "inst_GPIO27";
gpio26.gpioPin.$assign = "GPIO27";

gpio27.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio27.$name           = "inst_GPIO30";
gpio27.gpioPin.$assign = "GPIO30";

gpio28.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio28.$name           = "inst_GPIO32";
gpio28.gpioPin.$assign = "GPIO32";

gpio29.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio29.$name           = "inst_GPIO33";
gpio29.gpioPin.$assign = "GPIO33";

gpio30.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio30.$name           = "inst_GPIO36";
gpio30.gpioPin.$assign = "GPIO36";

gpio31.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio31.$name           = "inst_GPIO43";
gpio31.gpioPin.$assign = "GPIO43";

gpio32.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio32.$name           = "inst_GPIO53";
gpio32.gpioPin.$assign = "GPIO53";

gpio33.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio33.$name           = "inst_GPIO54";
gpio33.gpioPin.$assign = "GPIO54";

gpio34.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio34.$name           = "inst_GPIO55";
gpio34.gpioPin.$assign = "GPIO55";

