convesys/CS-1211_Test/05_Project/SW_TEST_sysconfig_337zwt/c2000.syscfg
gpio35.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio35.$name           = "inst_GPIO56";
gpio35.gpioPin.$assign = "GPIO56";

gpio36.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio36.$name           = "inst_GPIO57";
gpio36.gpioPin.$assign = "GPIO57";

gpio37.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio37.$name           = "inst_GPIO62";
gpio37.gpioPin.$assign = "GPIO62";

gpio38.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio38.$name           = "inst_GPIO63";
gpio38.gpioPin.$assign = "GPIO63";

gpio39.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio39.$name           = "inst_GPIO64";
gpio39.gpioPin.$assign = "GPIO64";

gpio40.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio40.$name           = "inst_GPIO65";
gpio40.gpioPin.$assign = "GPIO65";

gpio41.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio41.$name           = "inst_GPIO66";
gpio41.gpioPin.$assign = "GPIO66";

gpio42.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio42.$name           = "inst_GPIO84";
gpio42.gpioPin.$assign = "GPIO84";

gpio43.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio43.$name           = "inst_GPIO93";
gpio43.gpioPin.$assign = "GPIO93";

gpio44.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio44.$name           = "inst_GPIO94";
gpio44.gpioPin.$assign = "GPIO94";

gpio45.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio45.$name           = "inst_GPIO95";
gpio45.gpioPin.$assign = "GPIO95";

gpio46.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio46.$name           = "inst_GPIO96";
gpio46.gpioPin.$assign = "GPIO96";

gpio47.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio47.$name           = "inst_GPIO97";
gpio47.gpioPin.$assign = "GPIO97";

gpio48.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio48.$name           = "inst_GPIO98";
gpio48.gpioPin.$assign = "GPIO98";

gpio49.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio49.$name           = "inst_GPIO99";
gpio49.gpioPin.$assign = "GPIO99";

gpio50.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio50.$name           = "inst_GPIO100";
gpio50.gpioPin.$assign = "GPIO100";

gpio51.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio51.$name           = "inst_GPIO101";
gpio51.gpioPin.$assign = "GPIO101";

gpio52.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio52.$name           = "inst_GPIO102";
gpio52.gpioPin.$assign = "GPIO102";

gpio53.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio53.$name           = "inst_GPIO103";
gpio53.gpioPin.$assign = "GPIO103";

gpio54.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio54.$name           = "inst_GPIO104";
gpio54.gpioPin.$assign = "GPIO104";

gpio55.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio55.$name           = "inst_GPIO105";
gpio55.gpioPin.$assign = "GPIO105";

gpio56.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio56.$name           = "inst_GPIO108";
gpio56.gpioPin.$assign = "GPIO108";

gpio57.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio57.$name           = "inst_GPIO110";
gpio57.gpioPin.$assign = "GPIO110";

gpio58.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio58.$name           = "inst_GPIO111";
gpio58.gpioPin.$assign = "GPIO111";

gpio59.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio59.$name           = "inst_GPIO119";
gpio59.gpioPin.$assign = "GPIO119";

gpio60.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio60.$name           = "inst_GPIO125";
gpio60.gpioPin.$assign = "GPIO125";

gpio61.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio61.$name           = "inst_GPIO126";
gpio61.gpioPin.$assign = "GPIO126";

gpio62.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio62.$name           = "inst_GPIO127";
gpio62.gpioPin.$assign = "GPIO127";

gpio63.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio63.$name           = "inst_GPIO128";
gpio63.gpioPin.$assign = "GPIO128";

gpio64.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio64.$name           = "inst_GPIO129";
gpio64.gpioPin.$assign = "GPIO129";

gpio65.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio65.$name           = "inst_GPIO130";
gpio65.gpioPin.$assign = "GPIO130";

gpio66.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio66.$name           = "inst_GPIO131";
gpio66.gpioPin.$assign = "GPIO131";

gpio67.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio67.$name           = "inst_GPIO132";
gpio67.gpioPin.$assign = "GPIO132";

gpio68.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio68.$name           = "inst_GPIO133";
gpio68.gpioPin.$assign = "GPIO133";

gpio69.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio69.$name           = "inst_GPIO134";
gpio69.gpioPin.$assign = "GPIO134";

gpio70.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio70.$name           = "inst_GPIO135";
gpio70.gpioPin.$assign = "GPIO135";

gpio71.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio71.$name           = "inst_GPIO136";
gpio71.gpioPin.$assign = "GPIO136";

gpio72.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio72.$name           = "inst_GPIO137";
gpio72.gpioPin.$assign = "GPIO137";

gpio73.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio73.$name           = "inst_GPIO138";
gpio73.gpioPin.$assign = "GPIO138";

gpio74.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio74.$name           = "inst_GPIO139";
gpio74.gpioPin.$assign = "GPIO139";

gpio75.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio75.$name           = "inst_GPIO140";
gpio75.gpioPin.$assign = "GPIO140";

gpio76.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio76.$name           = "inst_GPIO141";
gpio76.gpioPin.$assign = "GPIO141";

gpio77.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio77.$name           = "inst_GPIO142";
gpio77.gpioPin.$assign = "GPIO142";

gpio78.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio78.$name           = "inst_GPIO143";
gpio78.gpioPin.$assign = "GPIO143";

gpio79.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio79.$name           = "inst_GPIO144";
gpio79.gpioPin.$assign = "GPIO144";

gpio80.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio80.$name           = "inst_GPIO145";
gpio80.gpioPin.$assign = "GPIO145";

gpio81.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio81.$name           = "inst_GPIO146";
gpio81.gpioPin.$assign = "GPIO146";

gpio82.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio82.$name           = "inst_GPIO147";
gpio82.gpioPin.$assign = "GPIO147";

gpio83.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio83.$name           = "inst_GPIO148";
gpio83.gpioPin.$assign = "GPIO148";

gpio84.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio84.$name           = "inst_GPIO149";
gpio84.gpioPin.$assign = "GPIO149";

gpio85.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio85.$name           = "inst_GPIO150";
gpio85.gpioPin.$assign = "GPIO150";

gpio86.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio86.$name           = "inst_GPIO151";
gpio86.gpioPin.$assign = "GPIO151";

gpio87.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio87.$name           = "inst_GPIO152";
gpio87.gpioPin.$assign = "GPIO152";

gpio88.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio88.$name           = "inst_GPIO153";
gpio88.gpioPin.$assign = "GPIO153";

gpio89.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio89.$name           = "inst_GPIO154";
gpio89.gpioPin.$assign = "GPIO154";

gpio90.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio90.$name           = "inst_GPIO155";
gpio90.gpioPin.$assign = "GPIO155";

