convesys/CS-1211_Test/05_Project/SW_TEST_sysconfig_337zwt/c2000.syscfg
gpio91.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio91.$name           = "inst_GPIO156";
gpio91.gpioPin.$assign = "GPIO156";

gpio92.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio92.$name           = "inst_GPIO157";
gpio92.gpioPin.$assign = "GPIO157";

gpio93.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio93.$name           = "inst_GPIO158";
gpio93.gpioPin.$assign = "GPIO158";

gpio94.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio94.$name           = "inst_GPIO159";
gpio94.gpioPin.$assign = "GPIO159";

gpio95.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio95.$name           = "inst_GPIO160";
gpio95.gpioPin.$assign = "GPIO160";

gpio96.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio96.$name           = "inst_GPIO161";
gpio96.gpioPin.$assign = "GPIO161";

gpio97.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio97.$name           = "inst_GPIO162";
gpio97.gpioPin.$assign = "GPIO162";

gpio98.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio98.$name           = "inst_GPIO163";
gpio98.gpioPin.$assign = "GPIO163";

gpio99.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio99.$name           = "inst_GPIO164";
gpio99.gpioPin.$assign = "GPIO164";

gpio100.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio100.$name           = "inst_GPIO165";
gpio100.gpioPin.$assign = "GPIO165";

gpio101.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio101.$name           = "inst_GPIO166";
gpio101.gpioPin.$assign = "GPIO166";

gpio102.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio102.$name           = "inst_GPIO167";
gpio102.gpioPin.$assign = "GPIO167";

gpio103.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio103.$name           = "inst_GPIO168";
gpio103.gpioPin.$assign = "GPIO168";

gpio104.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio104.$name           = "inst_GPIO72";
gpio104.gpioPin.$assign = "GPIO72";

sci1.selectRegisteredInterrupts = ["registerRxInt","registerTxInt"];
sci1.enabledInterrupts          = ["SCI_INT_RXRDY_BRKDT","SCI_INT_TXRDY"];
sci1.enabledErrorInterrupts     = ["SCI_INT_FE","SCI_INT_OE","SCI_INT_PE","SCI_INT_RXERR"];
sci1.$name                      = "SCIA_inst";
sci1.parity                     = "SCI_CONFIG_PAR_EVEN";
sci1.enabledFIFOInterrupts      = ["SCI_INT_RXFF","SCI_INT_TXFF"];
sci1.rxFifo                     = "SCI_FIFO_RX1";
sci1.sci.$assign                = "SCIA";
sci1.sci.scirxdPin.$assign      = "GPIO28";
sci1.sci.scitxdPin.$assign      = "GPIO29";
sci1.rxQual.$name               = "myGPIOQUAL0";
sci1.rxQual.qualMode            = "GPIO_QUAL_3SAMPLE";
sci1.txQual.$name               = "myGPIOQUAL1";
sci1.txQual.qualMode            = "GPIO_QUAL_3SAMPLE";
sci1.txQual.padConfig           = "STD";
sci1.sciRXInt.enableInterrupt   = true;
sci1.sciTXInt.enableInterrupt   = true;

sysctl.enableNMIGlobalInterrupt = true;
sysctl.splitCode                = true;
